raibisch/ESP32_Luxtronik2/src/main.cpp
#include <Arduino.h>

// Build in libs
#include <Esp.h>
#include "soc/soc.h"
#include "soc/rtc_cntl_reg.h"
#include "esp_rom_gpio.h"
#include <FS.h>                  
#include <WiFi.h>                     
#include <ESPmDNS.h>                   
#include <ESPAsyncWebServer.h>         
#include <HTTPClient.h>                 
#include <base64.h>                   
//#include <Preferences.h>

// my includes
//#include "fs_switch.h"   // switch between SPIFFS and LittleFS
#include "debug_print.h" // debug_print macros

// my libs
#include "FileVarStore.h"
#include "AsyncWebLog.h" // auch ohne WEB_APP dann wird auf Serial1 umgeleitet

#ifdef WEB_APP
//#include "AsyncWebApp.h" todo: noch integrieren
#include "AsyncWebOTA.h"
#endif

#include "ESP32ntp.h"
#include "XPString.h"
#include "SmartGrid.h"
#include "LuxWebsocket.h"
#include "SMLdecode.h"
#include "PicoMQTT.h"

#ifdef SHI_MODBUS
#include "LuxModbusSHI.h"
#endif

// special for S2 and S4
#if defined ESP_S2_MINI || ESP_S3_ZERO || ESP_S3_DEVKIT
#include "driver/temp_sensor.h"
#endif

#include "relay.h"
#include "ds100.h"

#ifdef ESP32_DEVKIT1
#if !((defined ESP32_RELAY_X4 || defined ESP32_RELAY_X2) || defined ESP32_NORELAY_X4)
#pragma message("Info : ESP32_DEVKIT")
#define LED_GPIO 2
#endif
#endif

#ifdef ESP32_S2_MINI
#pragma message("Info : ESP32_S2_MINI")
#define LED_GPIO LED_BUILTIN    
#endif

#ifdef ESP32_S3_ZERO
 #pragma message("Info : ESP32_S3_ZERO")
 #define NEOPIXEL 21
#endif

#ifdef ESP32_S3_DEVKIT
  #pragma message("Info : ESP32_S3_DEVKIT")
 #define NEOPIXEL 48
#endif

#ifdef M5_COREINK
 #pragma message("Info : M5Stack CoreInk Module")
 #define LED_GPIO 10
#endif

const char* SYS_Version = "V0.9.7";
const char* SYS_CompileTime =  __DATE__;
static String  SYS_IP = "0.0.0.0";

#ifdef WEB_APP
// internal Webserver                                
AsyncWebServer webserver(80);
#endif

WiFiClient wificlient; // for Tibber-Pulse und Shelly oder Tasmota Relais REST-Interface *and* ModbusTCPClient

#ifdef LUX_WEBSERVICE
LuxWebsocket luxws; // Luxtronik Webservice
#endif

#if defined SML_TIBBER || defined SML_TASMOTA
// Energy-Meter data from Tibber-Pulse
SMLdecode smldecoder;
#endif

#ifdef MQTT_CLIENT
PicoMQTT::Client mqtt;
#endif

#ifdef SHI_MODBUS
LuxModbusSHI modbusSHI;
#endif

// fetch String;
String sFetch;

static bool _bNewDay = false;

// ntp client
const char* TimeServerLocal = "192.168.2.1";
const char* TimeServer      = "europe.pool.ntp.org";
const char* TimeZone        = "CET-1CEST,M3.5.0,M10.5.0/3";       // Central Europe
ESP32ntp ntpclient;

const long   TimerFastDuration = 300;
long   TimerFast = 0;
const long   TimerSlowDuration   = 2000;   
long   TimerSlow = 0;    

#if defined ESP32_S3_ZERO || defined ESP32_S3_DEVKIT
static char neopixel_color = 'w';
#define  setcolor(...) neopixel_color = __VA_ARGS__
#else
#define setcolor(...)
#endif

/// @brief  set builtin LED
/// @param i = HIGH / LOW
void setLED(uint8_t i)
{
#if defined (ESP32_S3_ZERO) || defined (ESP32_S3_DEVKIT)
if (i==0)
 {
    neopixelWrite(NEOPIXEL,0,0,0); // off
 }
 else
 {
    switch (neopixel_color)
    {
    case 'r': 
      neopixelWrite(NEOPIXEL,2,0,0); // red
      break;
    case 'g':
      neopixelWrite(NEOPIXEL,0,2,0); // green
      break;
    case 'b':
      neopixelWrite(NEOPIXEL,0,0,2); // blue
      break;
    case 'y':
       neopixelWrite(NEOPIXEL,1,1,0); // yellow
      break;
    case 'w':
      neopixelWrite(NEOPIXEL,1,1,1); // white
      break;
    default:
       break;
    }
 }
#else
 digitalWrite(LED_GPIO, i);
#endif
}

uint8_t blnk=0;
static void blinkLED()
{
  blnk = !blnk;
  setLED(blnk);
}
////////////////////////////////////////////
/// @brief init builtin LED
////////////////////////////////////////////
inline void initLED()
{
 #if defined ESP32_S3_ZERO || defined ESP32_S3_DEVKIT
  neopixel_color='w'; 
#else
  pinMode(LED_GPIO, OUTPUT);
  digitalWrite(LED_GPIO, HIGH);
#endif
  setcolor('w'); //white
  setLED(1);
}

void inline initFS()
{
  if (!myFS.begin())
  {
   debug_println("*** ERROR:FS Mount failed");
  } 
  else
  {
   debug_println("* INFO:FS Mount succesfull");
  }
}

 
//////////////////////////////////////////////////////
/// @brief  expand Class "FileVarStore" with variables
//////////////////////////////////////////////////////
class WPFileVarStore final: public FileVarStore 
{
 public:  
  // Device-Parameter
   String varDEVICE_s_name  = "ESP_LUXTRONIK2";
  // Wifi-Parameter
   String varWIFI_s_mode    = "AP"; // STA=client connect with Router,  AP=Access-Point-Mode (needs no router)
   String varWIFI_s_password= "";
   String varWIFI_s_ssid    = "espluxtronik2";

   String varLUX_s_url      = "192.168.2.101";
   String varLUX_s_password = "999999";

  #ifdef MQTT_CLIENT
   String varMQTT_s_url       = "192.168.2.22";
   String varMQTT_s_shellyht = "shellies/shellyhtg3-wohnzimmer/status/temperature:0";
  #endif

#if defined EPEX_PRICE || defined SG_READY
   int    varEPEX_i_low     = 22;   // cent per kwh
   int    varEPEX_i_high    = 26;   // cent per kwh
   int    varCOST_i_mwst    = 19;   // MwSt (=tax percent) of hour price
   float  varCOST_f_fix     = 17.2; // fix part of hour price in cent
#endif
#if defined SML_TASMOTA || defined SML_TIBBER
   String varSML_s_url      = "";
   String varSML_s_user     = "";
   String varSML_s_password = "";
#endif
#ifdef SG_READY
   String varSG_s_rule1     = "00,00,0,0,FIX"; // start_hour, stop_hour, val1, val2, rulemode ("FIX, "EPEX_LOWHOUR", "EPEX_HIGHHOUR", "EPEX_HIGHLIMIT" EPEX_LOWLIMIT)
   String varSG_s_rule2     = "00,00,0,0,FIX";
   String varSG_s_rule3     = "00,00,0.0,FIX";
   String varSG_s_rule4     = "00,00,0,0,FIX";
   String varSG_s_rule5     = "00,00,0,0,FIX";
   String varSG_s_rule6     = "00,00,0,0,FIX";

   String varSG_s_out1      = "GPIO_12";
   String varSG_s_out2      = "GPIO_10";
   String varSG_s_sg1       = "";        //  http://192.168.2.108/fetch?imax=6; for my ABL-Wallbox ESP Project     
   String varSG_s_sg2       = "";        //  http://192.168.2.137/cm?cmnd=Power1%201 Tasmota Relais1 1 on    (replace % with # in config)
   String varSG_s_sg3       = "";        //  http://192.168.2.137/cm?cmnd=Power1%200 Tasmota Relais1 2 off   ("                             ")
   String varSG_s_sg4       = "";        //  http://192.168.2.137/cm?cmnd=Backlog%20Power1%201%3BPower2%200   Tasmota Relais1=on, Relais2=off (replace % with # in config) switch Relais 1 and Relais 2 
#endif
#ifdef SHI_MODBUS
uint16_t varSHI_i_pcsp1      = 14;
uint16_t varSHI_i_pcsp2      = 14;
uint16_t varSHI_i_pcsp3      = 14;
uint16_t varSHI_i_pcsp4      = 14;
#endif


 protected:
   void GetVariables() 
   {
     varDEVICE_s_name     = GetVarString(GETVARNAME(varDEVICE_s_name));
     varWIFI_s_mode       = GetVarString(GETVARNAME(varWIFI_s_mode)); //STA or AP
     varWIFI_s_password   = GetVarString(GETVARNAME(varWIFI_s_password));
     varWIFI_s_ssid       = GetVarString(GETVARNAME(varWIFI_s_ssid));
#if defined SML_TASMOTA || defined SML_TIBBER
     varSML_s_url         = GetVarString(GETVARNAME(varSML_s_url));
     varSML_s_user        = GetVarString(GETVARNAME(varSML_s_user));
     varSML_s_password    = GetVarString(GETVARNAME(varSML_s_password));
#endif
     varLUX_s_url         = GetVarString(GETVARNAME(varLUX_s_url));
     varLUX_s_password    = GetVarString(GETVARNAME(varLUX_s_password));

#ifdef SG_READY
     varEPEX_i_low        = GetVarInt(GETVARNAME(varEPEX_i_low));
     varEPEX_i_high       = GetVarInt(GETVARNAME(varEPEX_i_high));

     varSG_s_rule1         = GetVarString(GETVARNAME(varSG_s_rule1));
     varSG_s_rule2         = GetVarString(GETVARNAME(varSG_s_rule2));
     varSG_s_rule3         = GetVarString(GETVARNAME(varSG_s_rule3));
     varSG_s_rule4         = GetVarString(GETVARNAME(varSG_s_rule4));
     varSG_s_rule5         = GetVarString(GETVARNAME(varSG_s_rule5));
     varSG_s_rule6         = GetVarString(GETVARNAME(varSG_s_rule6));

     varSG_s_out1          = GetVarString(GETVARNAME(varSG_s_out1));
     varSG_s_out2          = GetVarString(GETVARNAME(varSG_s_out2));
     varSG_s_sg1           = GetVarString(GETVARNAME(varSG_s_sg1));
     varSG_s_sg2           = GetVarString(GETVARNAME(varSG_s_sg2));
     varSG_s_sg3           = GetVarString(GETVARNAME(varSG_s_sg3));
     varSG_s_sg4           = GetVarString(GETVARNAME(varSG_s_sg4));
#endif
#if defined SML_TASMOTA || defined SML_TIBBER
     varSML_s_url         = GetVarString(GETVARNAME(varSML_s_url));
     varSML_s_password    = GetVarString(GETVARNAME(varSML_s_password));
     varSML_s_user        = GetVarString(GETVARNAME(varSML_s_user));
#endif 
#ifdef SHI_MODBUS
     varSHI_i_pcsp1     = GetVarInt(GETVARNAME(varSHI_i_pcsp1),12);
     varSHI_i_pcsp2     = GetVarInt(GETVARNAME(varSHI_i_pcsp2),12);
     varSHI_i_pcsp3     = GetVarInt(GETVARNAME(varSHI_i_pcsp3),12);
     varSHI_i_pcsp4     = GetVarInt(GETVARNAME(varSHI_i_pcsp4),12);
#endif
#ifdef MQTT_CLIENT      
     varMQTT_s_url       = GetVarString(GETVARNAME(varMQTT_s_url));
     varMQTT_s_shellyht  = GetVarString(GETVARNAME(varMQTT_s_shellyht)); 
#endif
   }
};

WPFileVarStore varStore;



#ifdef MQTT_CLIENT
char _buf[60];
XPString s(_buf,60);

char _bufval[10];
XPString sval(_bufval,10);

// values from my room control unit, or set in Web-App
float    tempRoom = 20.0;
uint16_t setTempRoomOffset = 0;
uint16_t setExtraWW        = 0;

void inline initMQTT()
{
  // MQTT settings can be changed or set here instead
  mqtt.host = varStore.varMQTT_s_url;
  mqtt.client_id = "esplux" + WiFi.macAddress();
  // Subscribe to a topic and attach a callback: shelly HT3
  mqtt.subscribe(varStore.varMQTT_s_shellyht, [](const char * topic, const char * payload)
  {
    debug_printf("MQTT: '%s' = %s\n", topic, payload); 
    AsyncWebLog.printf("MQTT: %s: %s\r\n", topic, payload);
    s = payload;
    s.substringBeetween(sval,"tC",4,",",0);
    
    AsyncWebLog.printf("Room-Temp: %s\r\n", sval.c_str());
#ifdef LUX_WEBSERVICE
    luxws.tempRoom = atof(sval);
#else
    tempRoom = atof(sval);
#endif
  });
  
  mqtt.subscribe("hasp/RaumTermo/state/luxValues", [](const char * topic, const char * payload)
  {
    //debug_printf("MQTT: '%s' = %s\n", topic, payload); 
    //AsyncWebLog.printf("MQTT: %s: %s\r\n", topic, payload);

