raibisch/ESP32_Luxtronik2/src/main.cpp
    // topic:    hasp/RaumTermo/state/luxValues 
    // payload: {"tempOffset":0,"tempRoom":20.6,"extraWW":0}
    s = payload;
    
    // Achtung Raumbedienung gibt den Offset als relativen Wert von 21 Grad aus deshalb ->  + 210 bei Berechnung
    // könnte man auch bei der Raumbedienung ändern, so das ein absoluter Wert verwendet wird ;-
    sval.reset();
    s.substringBeetween(sval, "tempOffset",12,",",0);  
    AsyncWebLog.printf("[ROOM]TempOffset:%s\r\n", sval.c_str());
    setTempRoomOffset = atoi(sval);
   
    sval.reset();
    s.substringBeetween(sval, "extraWW",9,"}",0);
    AsyncWebLog.printf("[ROOM]extraWW:   %s\r\n", sval.c_str());
    setExtraWW = atoi(sval);

    if (setExtraWW == 1)
    {
      AsyncWebLog.printf("[ROOM] SET WW-Extra!! **\r\n");
      modbusSHI.setWWExtra();
    }

    sval.reset();
    s.substringBeetween(sval, "tempRoom",10,",",0);  
    float tempRoom2 = atof(sval);

    // alternativ: Wert von Raum-Controller nehmen
    if ((tempRoom == 20.0) && (tempRoom2 > 15.0)) 
    {
      tempRoom = tempRoom2; 
    }
    AsyncWebLog.printf("[ROOM]tempRoom: %02.1f\r\n", tempRoom);
   
    // Achtung Raumbedienung gibt den Offset als relativen Wert von 21 Grad aus deshalb ->  + 210
    // könnte man auch bei der Raumbedienung ändern, so das ein absoluter Wert verwendet wird ;-
    int16_t setpoint = modbusSHI.calcRoomOffset(tempRoom*10, 210+(setTempRoomOffset*10));
    modbusSHI.setHeatOffset(setpoint);
   
  });

  mqtt.begin();
}

#endif


#ifdef SG_READY
void setSGreadyOutput(uint8_t mode, uint8_t hour=24);
#endif

#if defined EPEX_PRICE || defined SG_READY
//////////////////////////////////////////////////////
/// @brief  expand Class "FileVarStore" with variables
//////////////////////////////////////////////////////
class SmartGridEPEX : public SmartGrid
{ 
  public:
  SmartGridEPEX(const char* epex) : SmartGrid(epex) {}

#ifndef M5_COREINK
  /// @brief 
  /// @return 
  bool getAppRules() final
  {

    for (size_t i = 0; i < SG_HOURSIZE; i++)
    {
      setHour_iVarSGready(i, DEFAULT_SGREADY_MODE);
    }
    bRule_OFF = false; // is set at rule "OFF"
#ifdef SG_READY
    calcSmartGridfromConfig(varStore.varSG_s_rule1.c_str());
    calcSmartGridfromConfig(varStore.varSG_s_rule2.c_str());
    calcSmartGridfromConfig(varStore.varSG_s_rule3.c_str());
    calcSmartGridfromConfig(varStore.varSG_s_rule4.c_str());
    calcSmartGridfromConfig(varStore.varSG_s_rule5.c_str());
    calcSmartGridfromConfig(varStore.varSG_s_rule6.c_str());  
#endif
   return true;
  }

#ifdef SG_READY
  /// @brief set hour output for Application
  /// @param hour 
  void setAppOutputFromRules(uint8_t hour) final
  {
    setSGreadyOutput(getHour_iVarSGready(hour));
  }
#endif
#endif


  /// @brief your individual calculation for Enduserprice (here: Tibber DE)
  /// @param rawprice 
  /// @return 
  float calcUserkWhPrice(float rawprice)
  {
    float f = (rawprice / 10.0) + (rawprice*varStore.varCOST_i_mwst/1000.0) +  varStore.varCOST_f_fix;
    //debug_printf("Epex-price:%f\r\n",rawprice);
    //debug_printf("User-price:%f\r\n",f);
    return f;
  }

#ifdef CALC_HOUR_ENERGYPRICE
  float getUserkWhFixPrice()
  { 
   return varStore.varCOST_f_kwh_fix;
  }
#endif
};

#define URL_ENERGY_CHARTS "api.energy-charts.info" 
SmartGridEPEX smartgrid(URL_ENERGY_CHARTS);
#endif

#ifdef SG_READY
/// @brief  Post a REST message to a web-device instaed of switching a Relais-Output-Pin
/// @param s  REST url
/// @return 
bool sendSGreadyURL(String s)
{
  HTTPClient http;
  
  if (s.startsWith("http:") == false)
  {
    AsyncWebLog.printf("No HTTP sendSGreadString:  %s\r\n" ,s.c_str());
     return false;   
  }

  AsyncWebLog.printf("sendSGreadURL: %s\r\n", s.c_str());
  int getlength;
  s.replace('#','%'); // because % % is used as html insert marker
  http.setConnectTimeout(800); // 16.02.2025 fix: if url not found or down
  http.begin(wificlient, s);
  int httpResponseCode = http.GET();
  
  if (httpResponseCode > 0) 
  {
    getlength = http.getSize();
    if (getlength > 0)
    {
      AsyncWebLog.printf("send OK: SG ready url: %s \r\n",s.c_str());
      http.end();
      return true;
    }
  }
  else 
  {
    AsyncWebLog.printf("ERROR: SG ready url: %s\r\n", s.c_str());
    debug_printf("sendSGreadyURL httpResponseCode: %d\r\n", httpResponseCode);
  }
  // Free resources
  http.end();

  return false;
}

/// @brief internel helper function
/// @param val of PC-Setpoint
void setSHIPCSetpoint(uint val)
{
#ifdef SHI_MODBUS
    modbusSHI.setPCSetpoint(val);
#endif
}


uint getSHIPCSetpoint(uint8_t sgrmode)
{
  uint setpoint = 10;
#ifdef SHI_MODBUS
  switch (sgrmode)
  {
  case 1:
    setpoint = varStore.varSHI_i_pcsp1;
    break;
  case 2:
    setpoint = varStore.varSHI_i_pcsp2;
    break;
  case 3:
    setpoint = varStore.varSHI_i_pcsp3;
    break;
  case 4:
     setpoint = varStore.varSHI_i_pcsp4;
    break;
  default:
    break;
  }
#endif
  return setpoint;
}


/// @brief 
/// @param mode SmartGrid-Mode
/// @param h    hour to set SmartGrid-Mode
void setSGreadyOutput(uint8_t mode, uint8_t hour)
{
  debug_printf("SetSGSGreadyOutput: %d hour:%d\r\n",mode, hour);
  if (hour > 23)
  { hour = ntpclient.getTimeInfo()->tm_hour;}

#ifdef WEB_APP
  AsyncWebLog.printf("SGreadyMode: %d  hour:%d\r\n",mode, hour);   
#endif
  smartgrid.setHour_iVarSGready(hour, mode); // override if value has changed
  String sURL;
  sURL.reserve(50);
  
  // activate switch only for actual hour
  if (hour != ntpclient.getTimeInfo()->tm_hour)
  {
    return;
  }

#ifdef SG_READY
  switch (mode)
  {
  case 1:
    setcolor('b');
    sendSGreadyURL(varStore.varSG_s_sg1);
#ifdef SHI_MODBUS
    setSHIPCSetpoint(varStore.varSHI_i_pcsp1);
#endif
    setRelay(1,1);
    setRelay(2,0);
    
    break;
  case 2:
    setcolor('g');
    sendSGreadyURL(varStore.varSG_s_sg2);
#ifdef SHI_MODBUS
    setSHIPCSetpoint(varStore.varSHI_i_pcsp2);
#endif
    setRelay(1,0);
    setRelay(2,0);
    break;
  case 3:
    setcolor('y');
    sendSGreadyURL(varStore.varSG_s_sg3);
#ifdef SHI_MODBUS
    setSHIPCSetpoint(varStore.varSHI_i_pcsp3);
#endif
    setRelay(1,0);
    setRelay(2,1);
    break;
  case 4:
    setcolor('r');
    sendSGreadyURL(varStore.varSG_s_sg4);
#ifdef SHI_MODBUS
    setSHIPCSetpoint(varStore.varSHI_i_pcsp4);
#endif
    setRelay(1,1);
    setRelay(2,1);
    break;  
  default:
    break;
  }
#elif defined LED_PRICE
   if (smartgrid.getUserkWhPrice(h) > varStore.varEPEX_i_high)
   {
     setcolor('r');
   }
   else if (smartgrid.getUserkWhPrice(h) > varStore.varEPEX_i_low)
   {
     setcolor('y');
   }
   else
  {
    setcolor('g');
  }
#endif
}
// endif SG_READY
#endif 


static String readString(File s) 
{
  String ret;
  int c = s.read();
  while (c >= 0) {
    ret += (char)c;
    c = s.read();
  }
  return ret;
}   

