raibisch/ESP32_Luxtronik2/src/main.cpp
void initFileVarStore()
{
  varStore.Load();
}       

//////////////////////////////////////////
/// @brief Init Wifi
/////////////////////////////////////////
void initWiFi()
{
#ifdef MINI_32
   WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG,0); // brownout problems
#endif   
   if (varStore.varWIFI_s_mode == "STA")
   {
    debug_printf("INFO-WIFI:STA-Mode\r\n");
    WiFi.mode(WIFI_STA);
    WiFi.setHostname(varStore.varDEVICE_s_name.c_str());
    WiFi.begin(varStore.varWIFI_s_ssid.c_str(), varStore.varWIFI_s_password.c_str());
    
    int i = 0;
    delay(200);
    setcolor('w');
    debug_printf("SSID:%s connecting\r\n", varStore.varWIFI_s_ssid);
    ///debug_printf("Passwort:%s\r\n", varStore.varWIFI_s_Password);
    while (!WiFi.isConnected())
    {
        debug_print(".");
        blinkLED();
        i++;  
        delay(200);
        if (i > 200)
        {
          ESP.restart();
        }
    }

    #if (defined ESP32_S3_ZERO || defined MINI_32 || defined M5_COREINK)
     WiFi.setTxPower(WIFI_POWER_7dBm);// brownout problems with some boards or low battery load for M5_COREINK
     //WiFi.setTxPower(WIFI_POWER_15dBm);// Test 15dB
    #endif

    #if (defined DEBUG_PRINT) && (defined ESP32_RELAY_X4 || defined ESP32_RELAY_X2)
    //WiFi.setTxPower(WIFI_POWER_MINUS_1dBm); // decrease power over serial TTY-Adapter
    #else
     WiFi.setTxPower(WIFI_POWER_19_5dBm);
    #endif

    Serial.println("CONNECTED!");
    Serial.printf("WiFi-Power:%d\r\n",WiFi.getTxPower());
    Serial.printf("WiFi-RSSI:%d\r\n",WiFi.RSSI());
      
    SYS_IP = WiFi.localIP().toString();
    Serial.printf("IP Address: %s", SYS_IP);

    if (!ntpclient.begin(TimeZone, TimeServerLocal, TimeServer))
    {
     ESP.restart();
    }
   }
   else
   {
    Serial.println("INFO-WIFI:AP-Mode");
    WiFi.mode(WIFI_AP);
    WiFi.softAP("esp-luxtronik");   
    Serial.printf("IP Address: %s", WiFi.softAPIP().toString());
   }
}     

void testWiFiReconnect()
{
  // Test if wifi is lost from router
  if ((varStore.varWIFI_s_mode == "STA") && (WiFi.status() != WL_CONNECTED))
    {
     debug_println("Reconnecting to WiFi...");
     delay(300);
     if (!WiFi.reconnect())
     {
      delay(200);
      ESP.restart();
     } 
   }
}

#ifdef WEB_APP
// -------------------- WEBSERVER -------------------------------------------
// --------------------------------------------------------------------------

/*
Absturz:
TIME: 20:37:44
func:setHtmlVar: DEVICEID
func:setHtmlVar: DEVICEID
func:setHtmlVar: LUX_IP
func:setHtmlVar: DEVICEID
Guru Meditation Error: Core  1 panic'ed (InstrFetchProhibited). Exception was unhandled.

... tritt setzt nicht mehr auf

*/

/// @brief replace placeholder "%<variable>%" in HTML-Code
/// @param var 
/// @return String
String sLocal;
String setHtmlVar(const String& var)
{
  sLocal = "";
  debug_print("func:setHtmlVar: ");
  debug_println(var);
 
  if (var == "CONFIG") // read config.txt
  {
    if (!myFS.exists("/config.txt")) 
    {
     return String(F("Error: File 'config.txt' not found!"));
    }
    // read "config.txt" 
    fs::File configfile = myFS.open("/config.txt", "r");   
    String sConfig;     
    if (configfile) 
    {
      sConfig = readString(configfile);
      configfile.close();
    }
    else 
    { // no "config.txt"
      sConfig = "";
    }
    return sConfig;
  } 
  else
  if (var== "DEVICEID")
  {
    return varStore.varDEVICE_s_name;
  }
  else
  if (var == "INFO")
  {
     sLocal =    "Version    :";
     sLocal += SYS_Version;  
     sLocal += "\nPlatform   :";
     sLocal +=  ESP.getChipModel();
     sLocal += "\nBuild-Date :";
     sLocal +=  F(__DATE__);
     sLocal += "\nIP-Addr    :";
     sLocal += SYS_IP;
     sLocal += "\nRSSI       :";
     sLocal += WiFi.RSSI();
     sLocal += "\nTemp.      :";
     sLocal += temperatureRead();   
     sLocal += "\nFreeHeap   :";
     sLocal += ESP.getFreeHeap();
     sLocal += "\nMinFreeHeap:";
     sLocal += ESP.getMinFreeHeap();
#ifdef SG_READY
     sLocal += "\n\nEPEX NEXT DATE:";
     sLocal +=  smartgrid.getWebDate(true); //sEPEXdateNext;
     sLocal +=  "\n";
     sLocal += smartgrid.getWebHourValueString(true);

     sLocal += "\n\nEPEX TODAY:";
     sLocal +=  "\n";
     sLocal += smartgrid.getWebHourValueString(false); //sEPEXPriceToday;
     //sLocal += "\n---\n\n";
#endif
     return sLocal;
  }
#ifdef EPEX_PRICE
  else
  if (var =="PRICE_LOW")
  {
     return String(varStore.varEPEX_i_low);      
  }
 else
  if (var =="PRICE_HIGH")
  {
     return String(varStore.varEPEX_i_high);     
  }
  else
  if (var == "COST_MWST")
  {
    return String(varStore.varCOST_i_mwst);
  }
  else
  if (var == "COST_FIX")
  {
    return String(varStore.varCOST_f_fix);
  }
  else
  if (var == "EPEX_ARRAY")
  {
    //return  smartgrid.getWebHourValueString(false);                      //EPEXPriceToday; // jetzt TODAY !!!
    String ret = smartgrid.getWebHourValueString(false);
    if (smartgrid.getWebHourValueString(true).length() > 0)
    {
     ret += ", ";
     ret += smartgrid.getWebHourValueString(true);
    }
    return ret;
  }
  else
  if (var == "EPEX_DATE")
  {
    String ret = smartgrid.getWebDate(false);
    ret += "   -    ";
    ret += smartgrid.getWebDate(true);
    return ret;
  }
  else
  if (var == "SGMODE")
  {
    //switch (SmartGridReadyStatus)
    switch (smartgrid.getHour_iVarSGready(ntpclient.getTimeInfo()->tm_hour))
    {
    case 1:
      return "sg1";
      break;
    case 2:
      return "sg2";
      break;
    case 3:
      return "sg3";
      break;
    case 4:
      return "sg4";
      break;
    default:
      break;
    }
    return "";
  }
  else
  if (var == "SGHOURMODE")
  {
    for (size_t i = 0; i < SG_HOURSIZE; i++)
    {
#ifdef SHI_MODBUS
      sLocal += getSHIPCSetpoint(smartgrid.getHour_iVarSGready(i)); // new: 2025-04-16
#else
      sLocal += smartgrid.getHour_iVarSGready(i);
#endif
      if (i < SG_HOURSIZE-1)
      {
        sLocal += ',';
      }
    }
    //sLocal += '0';
    return sLocal;
  }
#ifdef CALC_HOUR_ENERGYPRICE
  else
  if (var == "COSTINFO")
  { 
     sLocal =      "Flex(ct):";
    sLocal += String((smartgrid.getUserkWhPrice(ntpclient.getTimeInfo()->tm_hour)),1);
    sLocal +=   "  Fix (cnt):";
    sLocal += String(smartgrid.getUserkWhFixPrice(),1);
   
    sLocal +=  " Hour-kWh : ";
    sLocal +=  String((smldecoder.getInputkWh() /* valSML_kwh_in */ - smartgrid.hourprice_kwh_start),3);

    sLocal += "\r\n\r\nHour-flex:";
    sLocal += String(smartgrid.getFlexprice_hour(ntpclient.getTimeInfo()->tm_hour),2);
  
    sLocal +=   "  Day-flex :";
    sLocal += String(smartgrid.getFlexprice_monthday(ntpclient.getTimeInfo()->tm_mday),2);
    
    sLocal +=    " Month-flex:";
    sLocal += String(smartgrid.getFlexprice_month(ntpclient.getTimeInfo()->tm_mon),2);

