raibisch/ESP32_Luxtronik2/src/main.cpp
    //sLocal +=     "\r\nSum-flex     : ";
    //sLocal += String(smartgrid.Flexprice_sum + smartgrid.getAktFlexprice(),2);

    sLocal +=    "\r\nHour-fix: ";
    sLocal += String(smartgrid.getFixprice_hour(ntpclient.getTimeInfo()->tm_hour),2);

    sLocal +=     "  Day-fix  :";
    sLocal += String(smartgrid.getFixprice_monthday(ntpclient.getTimeInfo()->tm_mday),2);

    sLocal +=     "  Month-fix:";
    sLocal += String(smartgrid.getFixprice_month(ntpclient.getTimeInfo()->tm_mon) ,2);

    //sLocal +=     "\r\nSum-fix     : ";
    //sLocal += String(smartgrid.fixprice_sum + smartgrid.akt_fixprice,2);
    sLocal += "";

    return sLocal;
  }

  else
  if (var == "PRICE_FIX")
  {
     return String(smartgrid.getUserkWhFixPrice(),1);
  }

  else 
  if  (var == "PRICE_HOUR_FLEX")
  {
     for (size_t i = 0; i < 24; i++)
     {
      //sLocal += String(smartgrid.flexprice_hour[i],2);
      sLocal += String(smartgrid.getFlexprice_hour(i),2);
      if (i < 23)
      {
       sLocal += ", ";
      }
     }
     debug_println(sLocal);
     return sLocal;
  }
  else
  if (var == "PRICE_HOUR_FIX")
  {
     for (size_t i = 0; i <24; i++)
     {
      //sLocal += String(smartgrid.fixprice_hour[i],2);
      sLocal += String(smartgrid.getFixprice_hour(i),2);
      if (i < 23)
      {
       sLocal += ", ";
      }
     }
     return sLocal;
  }
  else
  if (var == "PRICE_MONTHDAY_FLEX")
  {
     for (size_t i = 1; i < 32; i++)
     {
      //sLocal += String(smartgrid.flexprice_monthday[i],2);
      sLocal += String(smartgrid.getFlexprice_monthday(i),2);
      if (i < 31)
      {
       sLocal += ", ";
      }
     }
     return sLocal;
  }
  else
  if (var == "PRICE_MONTHDAY_FIX")
  {
     for (size_t i = 1; i < 32; i++) // begin with "1" !!
     {
      //sLocal += String(smartgrid.fixprice_monthday[i],2);
      sLocal += String(smartgrid.getFixprice_monthday(i),2);
      if (i < 31)
      {
       sLocal += ", ";
      }
     }
     return sLocal;
  }
  else
  if (var == "PRICE_MONTH_FLEX")
  {
     for (size_t i = 0; i < 12; i++)
     {
      //sLocal += String(smartgrid.flexprice_month[i],2);
      sLocal += String(smartgrid.getFlexprice_month(i),2);
      if (i < 11)
      {
       sLocal += ", ";
      }
     }
     return sLocal;
  }
  else
  if (var == "PRICE_MONTH_FIX")
  {
     for (size_t i = 0; i < 12; i++)
     {
      //sLocal += String(smartgrid.fixprice_month[i],2);
      sLocal += String(smartgrid.getFixprice_month(i),2);
      if (i < 11)
      {
       sLocal += ", ";
      }
     }
     return sLocal;
  }
  else
  if (var == "COST_AKT_MONTH") // read config.txt
  {
    if (!myFS.exists("/cost_akt_month.txt")) 
    {
     return String(F("Error: File 'cost_akt_month.txt' not found!"));
    }
    // read "config.txt" 
    fs::File cfile = myFS.open("/cost_akt_month.txt", "r");   
    String sData;     
    if (cfile) 
    {
      sData = readString(cfile);
      cfile.close();
    }
    else 
    { // no "config.txt"
      sData = "";
    }
    return sData;
  }
  else
  if (var == "COST_AKT_YEAR") // read config.txt
  {
    if (!myFS.exists("/cost_akt_year.txt")) 
    {
     return String(F("Error: File 'cost_akt_year.txt' not found!"));
    }
    // read "config.txt" 
    fs::File cfile = myFS.open("/cost_akt_year.txt", "r");   
    String sData;     
    if (cfile) 
    {
      sData = readString(cfile);
      cfile.close();
    }
    else 
    { // no "config.txt"
      sData = "";
    }
    return sData;
  }
  #endif
  // EPEX_PRICE
  #endif 
  else
  if (var == "LUX_IP")
  {
    return varStore.varLUX_s_url;
  }
#ifdef SHI_MODBUS
  else
  if (var == "SHIHEOFFSET")
  {
    //return "1.0";
    return String(float(modbusSHI.getHeatOffsetX10()/10.0), 1);
  }
  else
  if (var == "SHIPCSETPOINT")
  {
    //return "1.6";
    return String(float(modbusSHI.getPCSetpoint())/10.0, 1);
  }
  if (var == "SP_ROOM")
  {
    return String(21 + setTempRoomOffset);
  }
#endif

  return "";
}


void notFound(AsyncWebServerRequest *request) 
{
    request->send(404, "text/plain", "Not found");
}

void initWebServer()
{ 
  
  sFetch.reserve(250);
  // --------------- Base Pages:----------------------------------
  //Route for root / web page
  webserver.on("/",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/index.html", String(), false, setHtmlVar);
  });
  //Route for root /index web page
  webserver.on("/index.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/index.html", String(), false, setHtmlVar);
  });
 
  //Route for setup web page
  webserver.on("/setup.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/setup.html", String(), false, setHtmlVar);
  });
  //Route for config web page
  webserver.on("/config.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/config.html", String(), false, setHtmlVar);
  });
  //Route for Info-page
  webserver.on("/info.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/info.html", String(), false, setHtmlVar);
  });

  //Route for Home-Automation-page
  webserver.on("/homeauto.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/homeauto.html", String(), false, setHtmlVar);
  });

  // config.txt GET
  webserver.on("/reboot.html", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send(404, "text/plain", "RESTART !");
    delay(300);
    //saveHistory();
    ESP.restart();
  });
  //----------------------------------------------------------------------

  // Temp Icons:
  webserver.on("/temp_inside.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/temp_inside.png", String(), false, setHtmlVar);
  });
  
  webserver.on("/temp_outside.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/temp_outside.png", String(), false, setHtmlVar);
  });

  //Route for Luxtronik details page
  webserver.on("/luxtronik.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/luxtronik.html", String(), false, setHtmlVar);
  });

  //Route for meter page
  webserver.on("/meter.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/meter.html", String(), false, setHtmlVar);
  });
  
  //.. some code for the navigation icons
  webserver.on("/home.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/home.png", String(), false);
  });
  webserver.on("/file-list.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/file-list.png", String(), false);
  });
  webserver.on("/settings.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send(myFS, "/settings.png", String(), false);
  });

  webserver.on("/smartgrid.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send(myFS, "/smartgrid.html", String(), false, setHtmlVar);
  });
  
#ifdef SG_READY
  webserver.on("/sgready.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send(myFS, "/sgready.html", String(), false, setHtmlVar);
  });
  webserver.on("/reload.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/reload.png", String(), false);
  });
#endif

