raibisch/ESP32_Luxtronik2/src/main.cpp
// Smart-Home-Interface --------------------------------
  webserver.on("/shi.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
#ifdef LUX_WEBSERVICE
    // !!! WORKAROUNT !!! ... bis neues JSON interface läuft
    luxws.setpollstate(WS_POLL_STATUS::NO_POLLING); 
    // !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
  #endif
    request->send(myFS, "/shi.html", String(), false, setHtmlVar);
  });

  webserver.on("/shi.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send(myFS, "/shi.png", String(), false);
  });
  

  webserver.on("/fetch", HTTP_GET, [](AsyncWebServerRequest *request)
  {
                                                                      // Index:
    sFetch = ntpclient.getTimeString();                               // 0 = Time: 00:00
    sFetch += ",";
#ifdef SG_READY
    sFetch += smartgrid.getHour_iVarSGready(ntpclient.getTimeInfo()->tm_hour);// 1 = sg_status
#else
    sFetch += "-";
#endif
    sFetch += ',';
#ifdef LUX_WEBSERVICE
    sFetch += luxws.getval(LUX_VAL_TYPE::POWER_IN, true);       // 2 Power In
    sFetch += luxws.getCSVfetch(true);                          // 3...36 
#else
#ifdef SHI_MODBUS
    sFetch +=  modbusSHI.getStringWorkingMode();                      // 2 OFF, Heizung, Warmwasser, Abtauen
    sFetch += ',';
#ifdef DS100_MODBUS
    sFetch +=  valDS100_L1_W ;                                  // 3 Watt DS100 L1
    sFetch += ',';  
    sFetch += valDS100_L1_KWH;                                  // 4 kWh  DS100 L1
#else
    sFetch+= "0,0";
#endif
    sFetch += ',',
    sFetch += smldecoder.getWatt();                             // 5 Watt Hauptzaehler
    sFetch += ',';
    sFetch += (modbusSHI.getPower_InX100() * 100);              // 6 Luxtronik Watt IN
    sFetch += ',';
    sFetch += (modbusSHI.getPower_OutX100() * 100);             // 7 Luxtronik Watt OUT
    sFetch += ',';
    sFetch += (modbusSHI.getSumEnergy_InX100());                // 8 Luxtronik Sum kWh IN
    sFetch += ',';
    sFetch += (modbusSHI.getSumEnergy_OutX100());               // 9 Luxtronik Sum kWh OUT
    sFetch += ',';

    sFetch += tempRoom;                                         // 10 Celsius
    sFetch += ',';
    sFetch += (modbusSHI.getTempOutdoorX10() / 10.0);           // 11 Celsius
    sFetch += ',';
    
    sFetch += (modbusSHI.getTempWWX10() / 10.0);                // 12 Celsius
    sFetch += ',';
    sFetch += (modbusSHI.getRL_IstX10() / 10.0);                // 13 Celsius
    sFetch += ',';
    sFetch += (modbusSHI.getRL_SollX10() / 10.0);               // 14 Celsius
    sFetch += ',';
    sFetch += (modbusSHI.getVL_IstX10() / 10.0);                // 15 Celsius
 
    sFetch += ',';  
    sFetch += modbusSHI.getCOPWW();                             // 16 COP WW   
    sFetch += ','; 
    sFetch += modbusSHI.getCOPHE();                             // 17 COP HE
    sFetch += ',';
    sFetch += modbusSHI.getCOPSUM();                            // 18 COP SUM

    sFetch += ',';  
    sFetch += modbusSHI.getCOPdayWW();                          // 19 COP WW     
    sFetch += ','; 
    sFetch += modbusSHI.getCOPdayHE();                          // 20 COP HE
    sFetch += ',';
    sFetch += modbusSHI.getCOPdaySUM();                         // 21 COP SUM
#endif
    sFetch += ",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0";
#endif
    sFetch += ",end";     

    //debug_printf("server.on fetch: %s",sFetch.c_str());
    request->send(200, "text/plain", sFetch);  
  });

  // Route for style-sheet
  webserver.on("/style.css",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/style.css", String(), false);
  });

  
  // ...a lot of code only for icons and favicons ;-))
  webserver.on("/manifest.json",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/manifest.json", String(), false);
  });
  webserver.on("/favicon.ico",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/favicon.ico", String(), false);
  });
  webserver.on("/apple-touch-icon.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/apple-touch-icon.png", String(), false);
  });
  webserver.on("/android-chrome-192x192.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/android-chrome-192x192.png", String(), false);
  });
  webserver.on("/android-chrome-384x384.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/android-chrome-384x384.png", String(), false);
  });
  

  // App-Icons
  webserver.on("/current.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/current.png", String(), false);
  });
  webserver.on("/sg.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/sg.png", String(), false);
  });
  webserver.on("/sgready.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/sgready.png", String(), false);
  });
  webserver.on("/heatpump.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/heatpump.png", String(), false);
  });
   webserver.on("/luxtronik.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/luxtronik.png", String(), false);
  });
  webserver.on("/homeauto.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/homeauto.png", String(), false);
  });

  // at index.html Luxtronic status
  webserver.on("/poweroff.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/poweroff.png", String(), false);
  });
  
  webserver.on("/hotwater.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/hotwater.png", String(), false);

  }); webserver.on("/radiator.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/radiator.png", String(), false);

  }); webserver.on("/defrost.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(myFS, "/defrost.png", String(), false);
  });

