raibisch/ESP32_Luxtronik2/src/main.cpp
  // fetch GET
  webserver.on("/fetchmeter", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    sFetch = "";
#ifdef DS100_MODBUS   
    sFetch = valDS100_L1_W;       // 0
    sFetch+= ',';
    sFetch+= valDS100_L2_W;       // 1
    sFetch+= ',';               
    sFetch+= valDS100_L3_W;       // 2
    sFetch+= ',';
    sFetch+= valDS100_L1_KWH*10;  // 3
    sFetch+= ',';
    sFetch+= valDS100_L2_KWH*10;  // 4
    sFetch+= ',';
    sFetch+= valDS100_L3_KWH*10;  // 5
    sFetch+= ',';
    sFetch+= valDS100_mV;         //6
#else
    sFetch = "--,--,--,--,--,--,--";
#endif
#if defined SML_TIBBER || defined SML_TASMOTA
    sFetch+= ',';
    sFetch+= smldecoder.getWatt();  // 7
    sFetch+= ',';
    sFetch+= smldecoder.getInputkWh(); // 8
    sFetch+= ',';
    sFetch+= smldecoder.getOutputkWh(); // 9
#else
    sFetch+= ",--,--,--";
#endif
    request->send(200, "text/plain", sFetch);
    //debug_println("server.on /fetchmeter: "+ s);
  });

  // -------------------- POST --------------------------------------------------
   // sgready.html POST
   #ifdef SG_READY
   webserver.on("/sgready.html",          HTTP_POST, [](AsyncWebServerRequest *request)
   {
    uint8_t i = 0;
    int iVal  = request->arg(i).toInt();
    const String sArg = request->argName(0);
    debug_printf(      "sgready POST: arg: %s  value:%d\r\n",sArg.c_str(), iVal);
    //AsyncWebLog.printf("sgready POST: arg: %s  value:%d\r\n",sArg.c_str(), iVal);
 
    if (sArg == "sg1")
    {
       setSGreadyOutput(1, iVal);
    }
    else
    if (sArg == "sg2")
    {
       setSGreadyOutput(2, iVal);
    }
    else
    if (sArg == "sg3")
    {
       setSGreadyOutput(3, iVal);
    }
    else
    if (sArg == "sg4")
    {
       setSGreadyOutput(4, iVal);
    }
    else 
    if (sArg == "sgsreload")
    {
     debug_println("sgsreload");
     smartgrid.getAppRules();   // old: setSmartGridRules(); // calulate rules from config
     smartgrid.setAppOutputFromRules(ntpclient.getTimeInfo()->tm_hour);
    }

    request->send(myFS, "/sgready.html", String(), false, setHtmlVar); 
   });
   #endif      

    // config.html POST
    webserver.on("/config.html",          HTTP_POST, [](AsyncWebServerRequest *request)
    {
     //debug_println("Argument: " + request->argName(0));
     //debug_println("Value: ");
     uint8_t i = 0;
     String s  = request->arg(i);
     debug_println(s);
     if (request->argName(0) == "saveconfig")
     {
         varStore.Save(s);
         varStore.Load();
#ifdef SG_READY
         smartgrid.refreshWebData(true); // new: 30.10.2024
         smartgrid.getAppRules();   // old: setSmartGridRules(); // calulate rules from config
#endif
     }
     request->send(myFS, "/config.html", String(), false, setHtmlVar);
    });

#ifdef SHI_MODBUS
    // config.html POST
    webserver.on("/shi.html",          HTTP_POST, [](AsyncWebServerRequest *request)
    {
         debug_printf("SHI- Argument: %s \r\n",request->argName(0));
         String sName = request->argName(size_t(0));
         String sVal  = request->arg(size_t(0));

         debug_printf("SHI-Arg: %s, Value: %s\r\n",sName.c_str(), sVal.c_str());
         if (sName == "range_temp")
         {
           debug_println("[SHI] SET-TEMP-OFFSET !!!");
           modbusSHI.setHeatOffset(int16_t(sVal.toFloat()*10.0));
         }
         else
         if (sName == "range_kw")
         {
          debug_println("[SHI] SET-KW !!!");
          modbusSHI.setPCSetpoint(int16_t(sVal.toFloat()*10.0));
         }
         else
         if (sName == "ww_extra")
         {
          modbusSHI.setWWExtra();
         }
         request->send(myFS, "/shi.html", String(), false, setHtmlVar); 
    });
 #endif
  
  AsyncWebLog.begin(&webserver);
  AsyncWebOTA.begin(&webserver);
  webserver.onNotFound(notFound);
  webserver.begin();
  debug_println("Init-Webserver OK!")
  }
#endif // WEB_APP


////////////////////////////////////////////////////
/// @brief setup
////////////////////////////////////////////////////
void setup() 
{
  Serial.begin(115200);                                           
  delay(500);
  Serial.println("***START***");
  delay(500);
  initLED();
  initRelay();
  initFS();
  initFileVarStore(); 
  setcolor('b'); // blue
  initWiFi();
  initWebServer(); 
  setLED(0);
  delay(500);
#ifdef EPEX_PRICE
  smartgrid.init();
#endif
#ifdef SML_TIBBER
  smldecoder.init(varStore.varSML_s_url.c_str(), varStore.varSML_s_user.c_str(), varStore.varSML_s_password.c_str());
#endif
#ifdef DS100_MODBUS
  DS100Init();
#endif
#ifdef MQTT_CLIENT
  initMQTT();
#endif
#ifdef SHI_MODBUS
  modbusSHI.init(varStore.varLUX_s_url.c_str());
#endif
#ifdef LUX_WEBSERVICE
  luxws.init(varStore.varLUX_s_url.c_str(), varStore.varLUX_s_password.c_str());
#endif
  delay(1000);
  Serial.println("***INIT-END***");
}

static uint old_minute, old_hour, old_day = 99;
///////////////////////////////////// TimePageSprite.drawString(20,10,buf, &Font0);///////////
/// @brief loop
////////////////////////////////////////////////
void loop() 
{
#ifdef LUX_WEBSERVICE
   luxws.loop();
#endif
#ifdef MQTT_CLIENT
   mqtt.loop();
#endif

   if (millis() - TimerSlowDuration > TimerSlow) 
   {
    TimerSlow = millis();                      // Reset time for next event
    testWiFiReconnect();
    ntpclient.update();
    tm* looptm = ntpclient.getTimeInfo();

    debug_printf("\r\nTIME: %s:%02d\r\n", ntpclient.getTimeString(), looptm->tm_sec);
    AsyncWebLog.printf("TIME: %s:%02d\r\n", ntpclient.getTimeString(), looptm->tm_sec);
    
#ifdef MQTT_CLIENT
    mqtt.loop();
#ifdef LUX_WEBSERVICE
    AsyncWebLog.printf("Raum-Temp: %2.1f \r\n", luxws.tempRoom);
#else
    AsyncWebLog.printf("Raum-Temp: %2.1f\r\n", tempRoom);
#endif
#endif
#ifdef SML_TIBBER
    smldecoder.read(); 
#ifdef LUX_WEBSERVICE
    luxws.power_Main_InMeter = smldecoder.getWatt();
#endif
#endif  
#ifdef DS100_MODBUS
    DS100read();
#ifdef LUX_WEBSERVICE
    luxws.energy_Sub_InMeter =  valDS100_L1_KWH;
#endif
#endif
#ifdef EPEX_PRICE
    time_t tt = ntpclient.getUnixTime();
    smartgrid.loop(&tt);
    if (smartgrid.bRule_OFF)
    {AsyncWebLog.printf("[SGR] Rule **OFF** !\r\n");}
#endif


